# -*- coding: utf-8 -*-
"""
Created on Sun Apr  4 17:30:43 2021

@author: 郭奕志
"""

# 作業:
# 今天課程中以一個案例，說明資料分析的流程與探索性分析，是否對於課程中一開始的問題，更有想法了?!
# 將答案寫在論壇中，大家一起互相討論激盪。

# =============================================================================
# # Q1: 哪一個問題不適合用資料科學解決?
# 挑選 Mr./Ms. Right
# 顧客下次會買哪些東西？
# 半導體的良率預測？
# =============================================================================

# Ans: 挑選 Mr./Ms. Right


# =============================================================================
# # Q2: 以你的角度來分析，為什麼這樣的問題，較不適合用資料來解決?
# =============================================================================


# Ans: 因無法用一種統一的標準，來量化人的個性與特質等。